#Сума двох чисел: Написати програму, яка зчитує два цілих числа та виводить їх суму.
n1 = int(input("Enter number1: "))
n2 = int(input("Enter number2: "))   
print(n1+n2)    

#Гіпотенуза: За двома катетами прямокутного трикутника знайти довжину його гіпотенузи.
a = int(input("Enter lenght1: "))
b = int(input("Enter lenght2: "))
c = (a + b)**2
print("Hypotenuse:", c)

#Двічі: Написати програму, яка зчитує ціле число та виводить його двічі.
n= int(input("Введіть ціле число: "))
print(n, n)

#Привіт, <ім'я>: Написати програму, яка запитує ім'я користувача і виводить привітання.
name=(input("What's ur name?: "))
print("Hi", name + "!")

#Прощавай, <ім'я>: Написати програму, яка запитує ім'я користувача і виводить прощання.
name=(input("What's ur name?: "))
print("Bye", name + "...")